In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%sql sqlite:///hw1_20205149.db

In [12]:
%sql PRAGMA foreign_keys = ON;

 * sqlite:///hw1_20205149.db
Done.

[]

In [13]:
%%sql -- Problem 1

create table branch (
branch_name varchar(20),
branch_city varchar(20),
assets INT(11),
primary key (branch_name)
);

create table customer (
customer_name varchar(20),
customer_street varchar(20),
customer_city varchar(20),
primary key (customer_name)
); 

create table loan (
loan_number varchar(20),
branch_name varchar(20),
amount INT(11),
primary key (loan_number),
foreign key (branch_name) references branch(branch_name)
    on delete cascade
); 

create table borrower (
customer_name varchar(20),
loan_number varchar(20),
primary key (customer_name, loan_number),
foreign key (customer_name) references customer(customer_name)
    on delete cascade,
foreign key (loan_number) references loan(loan_number)
    on delete cascade
); 

create table account (
account_number varchar(20),
branch_name varchar(20),
balance INT(11),
primary key (account_number),
foreign key (branch_name) references branch(branch_name)
    on delete cascade
);

create table depositor (
customer_name varchar(20),
account_number varchar(20),
primary key (customer_name, account_number),
foreign key (customer_name) references customer(customer_name)
    on delete cascade
foreign key (account_number) references account(account_number)
    on delete cascade
);

 * sqlite:///hw1_20205149.db
(sqlite3.OperationalError) table branch already exists
[SQL: create table branch (
branch_name varchar(20),
branch_city varchar(20),
assets INT(11),
primary key (branch_name)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [14]:
%%sql -- Problem 2 - (1)
insert into branch values
    ('GIST','Gwangju', 20205149),
    ('GIST1','Gwangju', 20206000),
    ('KAIST','Daejeon', 20207000),
    ('KAIST1','Daejeon', 20204000);

insert into customer values
    ('haeun', '123 street', 'cheomdan'),
    ('leehaeun', '123 street', 'cheomdan'),
    ('lee', '123 street', 'cheomdan'),
    ('ha', '123 street', 'cheomdan'),
    ('eun', '123 street', 'cheomdan'),
    ('lhe', '123 street', 'cheomdan');

insert into loan values
    ('1', 'GIST', 85000),
    ('2', 'GIST', 75000),
    ('3', 'GIST', 1999),
    ('4', 'GIST1', 1000),
    ('5', 'GIST1', 40000),
    ('6', 'KAIST', 30000),
    ('7', 'KAIST', 73000),
    ('8', 'KAIST1', 100000);

insert into borrower values
    ('haeun', '1'),
    ('leehaeun', '2'),
    ('haeun', '3'),
    ('haeun', '4'),
    ('ha', '5'),
    ('eun', '6'),
    ('ha', '7'),
    ('lhe', '8');

insert into account values
    ('1', 'GIST', 1000),
    ('2', 'GIST', 2000),
    ('3', 'GIST1', 300),
    ('4', 'GIST1', 100),
    ('5', 'KAIST', 2000),
    ('6', 'KAIST1', 2700),
    ('7', 'KAIST1', 200),
    ('8', 'KAIST1', 2700);

insert into depositor values
    ('haeun', '1'),
    ('lee', '2'),
    ('haeun', '3');

 * sqlite:///hw1_20205149.db
4 rows affected.
6 rows affected.
8 rows affected.
8 rows affected.
8 rows affected.
3 rows affected.

[]

In [15]:
%%sql -- Problem 2 - (2)
select *
from branch

 * sqlite:///hw1_20205149.db
Done.

[('GIST', 'Gwangju', 20205149),
 ('GIST1', 'Gwangju', 20206000),
 ('KAIST', 'Daejeon', 20207000),
 ('KAIST1', 'Daejeon', 20204000)]

In [16]:
%%sql -- Problem 2 - (3)
select *
from customer

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '123 street', 'cheomdan'),
 ('leehaeun', '123 street', 'cheomdan'),
 ('lee', '123 street', 'cheomdan'),
 ('ha', '123 street', 'cheomdan'),
 ('eun', '123 street', 'cheomdan'),
 ('lhe', '123 street', 'cheomdan')]

In [17]:
%%sql -- Problem 2 - (4)
select *
from loan

 * sqlite:///hw1_20205149.db
Done.

[('1', 'GIST', 85000),
 ('2', 'GIST', 75000),
 ('3', 'GIST', 1999),
 ('4', 'GIST1', 1000),
 ('5', 'GIST1', 40000),
 ('6', 'KAIST', 30000),
 ('7', 'KAIST', 73000),
 ('8', 'KAIST1', 100000)]

In [18]:
%%sql -- Problem 2 - (5)
select *
from borrower

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '1'),
 ('leehaeun', '2'),
 ('haeun', '3'),
 ('haeun', '4'),
 ('ha', '5'),
 ('eun', '6'),
 ('ha', '7'),
 ('lhe', '8')]

In [19]:
%%sql -- Problem 2 - (6)
select *
from account

 * sqlite:///hw1_20205149.db
Done.

[('1', 'GIST', 1000),
 ('2', 'GIST', 2000),
 ('3', 'GIST1', 300),
 ('4', 'GIST1', 100),
 ('5', 'KAIST', 2000),
 ('6', 'KAIST1', 2700),
 ('7', 'KAIST1', 200),
 ('8', 'KAIST1', 2700)]

In [20]:
%%sql -- Problem 2 - (6)
select *
from depositor

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '1'), ('lee', '2'), ('haeun', '3')]

In [21]:
%%sql -- Problem 3
select loan_number
from loan
where branch_name = 'GIST' and amount > 2000;

 * sqlite:///hw1_20205149.db
Done.

[('1',), ('2',)]

In [22]:
%%sql -- Problem 4
select *
from customer
where customer_name in (select customer_name
                        from borrower
                        where loan_number in (select loan_number
                                              from loan
                                              where branch_name = 'GIST'))
order by customer_name

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '123 street', 'cheomdan'), ('leehaeun', '123 street', 'cheomdan')]

In [23]:
%%sql -- Problem 5
select loan_number
from loan
where amount >= 70000
    and amount <= 80000

 * sqlite:///hw1_20205149.db
Done.

[('2',), ('7',)]

In [24]:
%%sql -- Problem 6
with Gwangju_branch(assets)
    as (select assets
        from branch
        where branch_city = 'Gwangju')
select distinct branch_name
from branch, Gwangju_branch
where branch.assets > Gwangju_branch.assets

 * sqlite:///hw1_20205149.db
Done.

[('GIST1',), ('KAIST',)]

In [25]:
%%sql -- Problem 7
select *
from customer
where customer_name in (select customer_name
                        from depositor
                        where account_number in (select account_number
                                                 from account))
    and customer_name not in (select customer_name
                              from borrower
                              where loan_number in (select loan_number
                                                    from loan))

 * sqlite:///hw1_20205149.db
Done.

[('lee', '123 street', 'cheomdan')]

In [26]:
%%sql -- Problem 8
select branch_name, avg(balance)
from account
group by branch_name

 * sqlite:///hw1_20205149.db
Done.

[('GIST', 1500.0),
 ('GIST1', 200.0),
 ('KAIST', 2000.0),
 ('KAIST1', 1866.6666666666667)]

In [27]:
%%sql -- Problem 9
select branch_name, count(distinct customer_name)
from loan join borrower
    on loan.loan_number = borrower.loan_number
group by branch_name

 * sqlite:///hw1_20205149.db
Done.

[('GIST', 2), ('GIST1', 2), ('KAIST', 2), ('KAIST1', 1)]

In [28]:
%%sql -- Problem 10
select branch_name
from branch
where branch_name in (select branch_name
                      from account
                      group by branch_name
                      having avg(balance) > 1200)

 * sqlite:///hw1_20205149.db
Done.

[('GIST',), ('KAIST',), ('KAIST1',)]

In [29]:
%%sql -- Problem 11
select *
from customer
where customer_name in (select customer_name
                        from depositor
                        where account_number
                            in (select account_number
                                from account
                                where branch_name in
                                    (select branch_name
                                     from branch
                                     where branch_city = 'Gwangju')))

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '123 street', 'cheomdan'), ('lee', '123 street', 'cheomdan')]

In [30]:
%%sql -- Problem 12
with max_balance(balance)
    as (select max(balance)
        from account) 
select * 
from account, max_balance 
where account.balance = max_balance.balance;

 * sqlite:///hw1_20205149.db
Done.

[('6', 'KAIST1', 2700, 2700), ('8', 'KAIST1', 2700, 2700)]

In [31]:
%%sql -- Problem 13
with sum_balance(branch_name, total)
    as (select branch_name, sum(balance)
        from account
        group by branch_name),
    avg_sum_balance(value)
    as (select avg(total)
        from sum_balance)
select sum_balance.branch_name
from sum_balance, avg_sum_balance
where sum_balance.total > avg_sum_balance.value;

 * sqlite:///hw1_20205149.db
Done.

[('GIST',), ('KAIST1',)]

In [33]:
%%sql -- Problem 14
create view account_depositor(branch_name, customer_name1) as
select branch_name, customer_name
from account, depositor
where account.account_number = depositor.account_number;

create view loan_borrower(branch_name, customer_name2) as
select loan.branch_name, borrower.customer_name
from loan, borrower
where loan.loan_number = borrower.loan_number;

create view all_customer(branch_name, customer_name) as
select distinct branch.branch_name, customer_name
from branch, customer, account_depositor, loan_borrower 
where (branch.branch_name = account_depositor.branch_name 
       and customer.customer_name = account_depositor.customer_name1) or
    (branch.branch_name = loan_borrower.branch_name 
     and customer.customer_name = loan_borrower.customer_name2);

 * sqlite:///hw1_20205149.db
(sqlite3.OperationalError) table account_depositor already exists
[SQL: create view account_depositor(branch_name, customer_name1) as
select branch_name, customer_name
from account, depositor
where account.account_number = depositor.account_number;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [57]:
%%sql
select *
from account;

 * sqlite:///hw1_20205149.db
Done.

[('1', 'GIST', 1000),
 ('2', 'GIST', 2000),
 ('3', 'GIST1', 300),
 ('4', 'GIST1', 100),
 ('5', 'KAIST', 2000),
 ('6', 'KAIST1', 2700),
 ('7', 'KAIST1', 200),
 ('8', 'KAIST1', 2700)]

In [58]:
%%sql
select *
from depositor;

 * sqlite:///hw1_20205149.db
Done.

[('haeun', '1'), ('lee', '2'), ('haeun', '3')]

In [59]:
%%sql -- Problem 15
delete
from account
where branch_name in (select branch_name
                      from branch
                      where branch_city = 'Gwangju');

 * sqlite:///hw1_20205149.db
4 rows affected.

[]

In [60]:
%%sql
select *
from account;

 * sqlite:///hw1_20205149.db
Done.

[('5', 'KAIST', 2000),
 ('6', 'KAIST1', 2700),
 ('7', 'KAIST1', 200),
 ('8', 'KAIST1', 2700)]

In [61]:
%%sql
select *
from depositor;

 * sqlite:///hw1_20205149.db
Done.

[]

In [62]:
%%sql
select *
from account

 * sqlite:///hw1_20205149.db
Done.

[('5', 'KAIST', 2000),
 ('6', 'KAIST1', 2700),
 ('7', 'KAIST1', 200),
 ('8', 'KAIST1', 2700)]

In [63]:
%%sql -- Problem 16
update account
set balance = balance * 1.05
where balance > (select avg(balance) from account);

 * sqlite:///hw1_20205149.db
3 rows affected.

[]

In [64]:
%%sql
select *
from account

 * sqlite:///hw1_20205149.db
Done.

[('5', 'KAIST', 2100),
 ('6', 'KAIST1', 2835),
 ('7', 'KAIST1', 200),
 ('8', 'KAIST1', 2835)]